"""
Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2**k), 
не превосходящие числа N.
"""

k = int(input("Введите число k: "))
N = int(input("Введите максимальное число N: "))
for i in range(k):
    res = 2 ** i
    if res <= N:
        print(res)
    else:
        break